FV2610/E_0623.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">GPKE</FONT></B><BR align="left"/><BR/><B><FONT POINT-SIZE="16">6.6.4: AD: Lieferbeginn</FONT></B><BR align="left"/><BR/><BR/><BR/>>;
    ratio="compress";
    concentrate=true;
    pack=true;
    rankdir=TB;
    packmode="array";
    size="20,20";
    fontsize=12;
    pad=0.25;
    "Start" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#8ba2d7", label=<<B>E_0623</B><BR align="left"/><FONT>Prüfende Rolle: <B>NB</B></FONT><BR align="center"/>>, fontname="Roboto, sans-serif"];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>10: </B>Wurde der Anwendungsfall für eine verbrauchende Marktlokation oder ruhende<BR align="left"/>Marktlokation verwendet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>20: </B>Wurde eine Anfrage zur Beendigung der Zuordnung gestellt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "30" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>30: </B>Hat der LFA fristgerecht geantwortet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "40" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>40: </B>Hat der LFA der Anfrage zur Beendigung der Zuordnung widersprochen?<BR align="left"/>Hinweis: Im Fall der Zustimmung ist dem LFA, dem die Anfrage zur Beendigung der<BR align="left"/>Zuordnung zugestellt wurde in jedem Fall eine "Beendigung der Zuordnung des LFA<BR align="left"/>zur Marktlokation bzw. Tranche" zuzusenden.<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "50" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>50: </B>Wurde in der Beantwortung der Anfrage zur Beendigung der Zuordnung der Code A30<BR align="left"/>„Ablehnung: Die Belieferung wurde zu dem angefragten Termin aus der Anfrage zur<BR align="left"/>Beendigung der Zuordnung bereits beendet und eine Abmeldung von dem LFA bereits<BR align="left"/>versendet, die durch den NB bereits bestätigt wurde.“ verwendet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A50" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A50</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Der LFA hat der Anfrage zur Beendigung der Zuordnung widersprochen.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "60" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>60: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A51" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A51</B><BR align="left"/><BR align="left"/><FONT>Cluster: Zustimmung<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "A99" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A99</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Sonstiges<BR align="left"/>Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.<BR align="left"/>Nutzungsmöglichkeit Ende: 01.04.2027 00:00 Uhr<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "400" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>400: </B>Handelt es sich um Geschäftsvorfall 3?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "410" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>410: </B>Wurde eine Anfrage zur Beendigung der Zuordnung gestellt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "420" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>420: </B>Hat der LFA fristgerecht geantwortet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "430" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>430: </B>Hat der LFA der Anfrage zur Beendigung der Zuordnung widersprochen?<BR align="left"/>Hinweis: Im Fall der Zustimmung ist dem LFA, dem die Anfrage zur Beendigung der<BR align="left"/>Zuordnung zugestellt wurde in jedem Fall eine "Beendigung der Zuordnung des LFA<BR align="left"/>zur Marktlokation bzw. Tranche" zuzusenden.<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "440" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>440: </B>Wurde in der Beantwortung der Anfrage zur Beendigung der Zuordnung der Code A41<BR align="left"/>„Ablehnung: Die Belieferung wurde zu dem angefragten Termin aus der Anfrage zur<BR align="left"/>Beendigung der Zuordnung bereits beendet und eine Abmeldung von dem LFA bereits<BR align="left"/>versendet, die durch den NB bereits bestätigt wurde.“ verwendet?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A57" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A57</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Der LFA hat der Anfrage zur Beendigung der Zuordnung widersprochen.<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "450" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>450: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A58" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A58</B><BR align="left"/><BR align="left"/><FONT>Cluster: Zustimmung<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "500" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>500: </B>Wurden Anfragen zur Beendigung der Zuordnung an die zugeordneten Lieferanten<BR align="left"/>der Tranchen, an der Marktlokation gestellt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "510" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>510: </B>Wurde mindestens einer Anfrage zur Beendigung der Zuordnung zugestimmt?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A53" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A53</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Der gewünschte Prozentsatz an der Marktlokation ist nicht frei<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "520" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>520: </B>Ist ein ausreichend großer Prozentsatz an der Marktlokation frei geworden?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A54" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A54</B><BR align="left"/><BR align="left"/><FONT>Cluster: Ablehnung<BR align="left"/>Der gewünschte Prozentsatz an der Marktlokation ist nicht frei<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "530" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>530: </B>Verbleibt ein Anteil im Bilanzkreis des Netzbetreibers?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "540" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>540: </B>Handelt es sich um eine direktvermarktungspflichtige Marktlokation?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A55" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A55</B><BR align="left"/><BR align="left"/><FONT>Cluster: Zustimmung<BR align="left"/>Unter Bildung einer neuen Tranche sowie Info über fehlende Anteile an der Marktlokation in der Bilanzierung<BR align="left"/>Hinweis: Trigger für Prozess: Herstellung einer 100% LF-Zuordnung zu einer<BR align="left"/>Marktlokation beim NB<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];
    "600" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c2cee9", label=<<B>600: </B>Ist ein zuvor nicht spezifizierter Fehler aufgetreten?<BR align="left"/>>, fontname="Roboto, sans-serif"];
    "A56" [margin="0.2,0.12", shape=box, style="filled,rounded", penwidth=0.0, fillcolor="#c4cac1", label=<<B>A56</B><BR align="left"/><BR align="left"/><FONT>Cluster: Zustimmung<BR align="left"/>Unter Bildung einer neuen Tranche<BR align="left"/></FONT>>, fontname="Roboto, sans-serif"];

    "Start" -> "10" [color="#88a0d6"];
    "10" -> "20" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "10" -> "400" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "20" -> "60" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "20" -> "30" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "30" -> "40" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "30" -> "60" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "40" -> "50" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "40" -> "60" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "50" -> "A50" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "50" -> "60" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "60" -> "A51" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "60" -> "A99" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "400" -> "500" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "400" -> "410" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "410" -> "420" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "410" -> "450" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "420" -> "430" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "420" -> "450" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "430" -> "440" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "430" -> "450" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "440" -> "A57" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "440" -> "450" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "450" -> "A58" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "450" -> "A99" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "500" -> "510" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "500" -> "600" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "510" -> "520" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "510" -> "A53" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "520" -> "530" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "520" -> "A54" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "530" -> "540" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "530" -> "600" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "540" -> "A55" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "540" -> "600" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "600" -> "A56" [label=<<B>NEIN</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];
    "600" -> "A99" [label=<<B>JA</B>>, color="#88a0d6", fontname="Roboto, sans-serif"];

    bgcolor="transparent";
fontname="Roboto, sans-serif";
}
