FV2610/E_0623.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

footer
v4.3 | 23.06.2026 (urspr. 01.04.2026) | ebdamame v1.0.0 | rebdhuhn v1.2.0
endfooter

title
GPKE

6.6.4: AD: Lieferbeginn



end title
:<b>E_0623</b>;
note right
<b><i>Prüfende Rolle: NB
end note

if (<b>10: </b> Wurde der Anwendungsfall für eine verbrauchende Marktlokation oder ruhende Marktlokation verwendet?) then (ja)
    if (<b>20: </b> Wurde eine Anfrage zur Beendigung der Zuordnung gestellt?) then (ja)
        if (<b>30: </b> Hat der LFA fristgerecht geantwortet?) then (ja)
            if (<b>40: </b> Hat der LFA der Anfrage zur Beendigung der Zuordnung widersprochen?
Hinweis: Im Fall der Zustimmung ist dem LFA, dem die Anfrage zur Beendigung der Zuordnung zugestellt wurde in jedem Fall eine "Beendigung der Zuordnung des LFA zur Marktlokation bzw. Tranche" zuzusenden.) then (ja)
                if (<b>50: </b> Wurde in der Beantwortung der Anfrage zur Beendigung der Zuordnung der Code A30 „Ablehnung: Die Belieferung wurde zu dem angefragten Termin aus der Anfrage zur Beendigung der Zuordnung bereits beendet und eine Abmeldung von dem LFA bereits versendet, die durch den NB bereits bestätigt wurde.“ verwendet?) then (ja)
                else (nein)
                    :A50;
                    note left
                        Cluster: Ablehnung
                        Der LFA hat der Anfrage zur Beendigung der Zuordnung widersprochen.
                    endnote
                    kill;
                endif
                if (<b>60: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
                else (nein)
                    :A51;
                    note left
                        Cluster: Zustimmung
                    endnote
                    kill;
                endif
            else (nein)
            endif
        else (nein)
        endif
    else (nein)
    endif
    if (<b>60: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
    else (nein)
        :A51;
        note left
            Cluster: Zustimmung
        endnote
        kill;
    endif
else (nein)
    if (<b>400: </b> Handelt es sich um Geschäftsvorfall 3?) then (ja)
        if (<b>500: </b> Wurden Anfragen zur Beendigung der Zuordnung an die zugeordneten Lieferanten der Tranchen, an der Marktlokation gestellt?) then (ja)
            if (<b>510: </b> Wurde mindestens einer Anfrage zur Beendigung der Zuordnung zugestimmt?) then (ja)
            else (nein)
                :A53;
                note left
                    Cluster: Ablehnung
                    Der gewünschte Prozentsatz an der Marktlokation ist nicht frei
                endnote
                kill;
            endif
            if (<b>520: </b> Ist ein ausreichend großer Prozentsatz an der Marktlokation frei geworden?) then (ja)
            else (nein)
                :A54;
                note left
                    Cluster: Ablehnung
                    Der gewünschte Prozentsatz an der Marktlokation ist nicht frei
                endnote
                kill;
            endif
            if (<b>530: </b> Verbleibt ein Anteil im Bilanzkreis des Netzbetreibers?) then (ja)
                if (<b>540: </b> Handelt es sich um eine direktvermarktungspflichtige Marktlokation?) then (ja)
                    :A55;
                    note left
                        Cluster: Zustimmung
                        Unter Bildung einer neuen Tranche sowie Info über fehlende Anteile an der Marktlokation in der Bilanzierung
                        Hinweis: Trigger für Prozess: Herstellung einer 100% LF-Zuordnung zu einer Marktlokation beim NB
                    endnote
                    kill;
                else (nein)
                endif
                if (<b>600: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
                else (nein)
                    :A56;
                    note left
                        Cluster: Zustimmung
                        Unter Bildung einer neuen Tranche
                    endnote
                    kill;
                endif
            else (nein)
            endif
        else (nein)
        endif
        if (<b>600: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
        else (nein)
            :A56;
            note left
                Cluster: Zustimmung
                Unter Bildung einer neuen Tranche
            endnote
            kill;
        endif
    else (nein)
        if (<b>410: </b> Wurde eine Anfrage zur Beendigung der Zuordnung gestellt?) then (ja)
            if (<b>420: </b> Hat der LFA fristgerecht geantwortet?) then (ja)
                if (<b>430: </b> Hat der LFA der Anfrage zur Beendigung der Zuordnung widersprochen?
Hinweis: Im Fall der Zustimmung ist dem LFA, dem die Anfrage zur Beendigung der Zuordnung zugestellt wurde in jedem Fall eine "Beendigung der Zuordnung des LFA zur Marktlokation bzw. Tranche" zuzusenden.) then (ja)
                    if (<b>440: </b> Wurde in der Beantwortung der Anfrage zur Beendigung der Zuordnung der Code A41 „Ablehnung: Die Belieferung wurde zu dem angefragten Termin aus der Anfrage zur Beendigung der Zuordnung bereits beendet und eine Abmeldung von dem LFA bereits versendet, die durch den NB bereits bestätigt wurde.“ verwendet?) then (ja)
                    else (nein)
                        :A57;
                        note left
                            Cluster: Ablehnung
                            Der LFA hat der Anfrage zur Beendigung der Zuordnung widersprochen.
                        endnote
                        kill;
                    endif
                    if (<b>450: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
                    else (nein)
                        :A58;
                        note left
                            Cluster: Zustimmung
                        endnote
                        kill;
                    endif
                else (nein)
                endif
            else (nein)
            endif
        else (nein)
        endif
        if (<b>450: </b> Ist ein zuvor nicht spezifizierter Fehler aufgetreten?) then (ja)
        else (nein)
            :A58;
            note left
                Cluster: Zustimmung
            endnote
            kill;
        endif
    endif
endif
:A99;
note left
    Cluster: Ablehnung
    Sonstiges 
    Hinweis: Das identifizierte Problem ist in der Antwort zu beschreiben/benennen.
    Nutzungsmöglichkeit Ende: 01.04.2027 00:00 Uhr
endnote
kill;

@enduml
